# InvalidDBviewScopeBox Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ViewFailures..::..InvalidDBviewScopeBox Property
BuiltInFailures..::..ViewFailures Class See Also
---
The scope box and view must have parallel vertical axes.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidDBviewScopeBox { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidDBviewScopeBox As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidDBviewScopeBox {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ViewFailures Class
Autodesk.Revit.DB Namespace